Revit 2024 API
CurveLoop.GetCurveLoopIterator Method
 Returns a curve that iterates through the curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public CurveLoopIterator GetCurveLoopIterator()
Visual Basic
Public Function GetCurveLoopIterator As CurveLoopIterator
Visual C++
public:
CurveLoopIterator^ GetCurveLoopIterator()
Return Value
 A curve loop iterator object that can be used to iterate through key-value pairs in the collection.
See Also
CurveLoop Class
Autodesk.Revit.DB Namespace